from django.shortcuts import render,redirect
import pandas as pd
from django.http import JsonResponse
from .models import Norma,Nakleyka,Kraska,Ximikat,SubDekorPlonka,Skotch,Lamplonka,KleyDlyaLamp,AlyuminniysilindrEkstruziya1,AlyuminniysilindrEkstruziya2,TermomostDlyaTermo,SiryoDlyaUpakovki,ProchiyeSiryoNeno,NormaExcelFiles
from .forms import NormaFileForm
from django.db.models import Q
from config.settings import MEDIA_ROOT
# Create your views here.

def index(request):
    return render(request,'norma/index.html')

# Create your views here.
def norma_excel(request):
    df = pd.read_excel('C:\\OpenServer\\domains\\Norma22.xlsx','Общий')
    df =df.astype(str)
    for i in range(0,df.shape[0]):
        устаревший = df["Устаревший"][i]
        компонент_1 = df["КОМПОНЕНТ 1"][i]
        компонент_2 = df["КОМПОНЕНТ 2"][i]
        компонент_3 = df["КОМПОНЕНТ 3"][i]
        артикул = df["АРТИКУЛ"][i]
        серия = df["Серия"][i]
        наименование = df["Наименование"][i]
        внешний_периметр_профиля_мм = df["Внешний периметр профиля__ мм"][i]
        площадь_мм21 = df["Площадь __мм²"][i]
        площадь_мм22 = df["Площадь __мм²"][i]
        удельный_вес_профиля_кг_м = df["Удельный вес профиля кг__м"][i]
        диаметр_описанной_окружности_мм = df["Диаметр описанной окружности__мм"][i]
        длина_профиля_м = df["Длина профиля__м"][i]
        расчетное_колво_профиля_шт = df["Расчетное кол-во профиля__шт"][i]
        общий_вес_профиля_кг = df["Общий вес профиля__кг"][i]
        алю_сп_6063_рас_спа_на_1000_шт_пр_кг = df["Алюминиевый сплав 6063 __ расход сплава на 1000 шт профиля__кг"][i]
        алю_сплав_6063_при_этом_тех_отхода1 = df["Алюминиевый сплав 6063 __ при этом __ тех.отхода1"][i]
        алю_сплав_6063_при_этом_тех_отхода2 = df["Алюминиевый сплав 6063 __ при этом __ тех.отхода2"][i]
        смазка_для_пресса_кг_графитовая = df["Смазка для пресса__кг __ Графитовая"][i]
        смазка_для_пресса_кг_пилы_хл_резки_сол = df["Смазка для пресса__кг __ пилы холодной резки (Солярка)"][i]
        смазка_для_пресса_кг_горячей_резки_сол = df["Смазка для пресса__кг __ горячей резки (Солярка)"][i]
        смазка_для_пресса_кг_графитовые_плиты = df["Смазка для пресса__кг __ графитовые плиты"][i]
        хим_пг_к_окр_politeknik_кг_pol_ac_25p = df["Химикаты (подготовка к окрашиванию)__ POLITEKNIK кг __ POLITOKSAL AC 25P"][i]
        хим_пг_к_окр_politeknik_кг_alupol_сr_51 = df["Химикаты (подготовка к окрашиванию)__ POLITEKNIK кг __ ALUPOL СR 51"][i]
        хим_пг_к_окр_politeknik_кг_alupol_ac_52 = df["Химикаты (подготовка к окрашиванию)__ POLITEKNIK кг __ ALUPOL AC 52"][i]
        пр_краситель_толщина_пк_мкм = df["Порошковый краситель __ толщина покрытия, мкм"][i]
        порошковый_краситель_рас_кг_на_1000_пр = df["Порошковый краситель __ расход __кг на 1000 профилей"][i]
        пр_краситель_при_этом_тех_отхода = df["Порошковый краситель __ при этом __ тех.отхода "][i]
        не_нужний = df["Не нужний"][i]
        суб_ширина_декор_пленки_мм_зол_дуб = df["Сублимация __ ширина декор пленки__мм (Зол.дуб)"][i]
        сублимация_расход_на_1000_профиль_м21 = df["Сублимация __ расход на 1000 профиль__м21"][i]
        суб_ширина_декор_пленки_мм_3д_313701 = df["Сублимация __ ширина декор пленки__мм (3Д 3137-01) "][i]
        сублимация_расход_на_1000_профиль_м22 = df["Сублимация __ расход на 1000 профиль__м22"][i]
        суб_ширина_декор_пленки_мм_дуб_мокко = df["Сублимация __ ширина декор пленки__мм (Дуб.мокко) "][i]
        сублимация_расход_на_1000_профиль_м23 = df["Сублимация __ расход на 1000 профиль__м23"][i]
        суб_ширина_декор_пленки_мм_3д_313702 = df["Сублимация __ ширина декор пленки__мм (3Д 3137-02) "][i]
        сублимация_расход_на_1000_профиль_м24 = df["Сублимация __ расход на 1000 профиль__м24"][i]
        молярный_скотч_ширина1_мол_скотча_мм = df["Молярный скотч __ ширина1мол- скотча__мм"][i]
        молярный_скотч_рас_на_1000_пр_шт1 = df["Молярный скотч __ расход на 1000 профиль__шт1"][i]
        молярный_скотч_ширина2_мол_скотча_мм = df["Молярный скотч __ ширина2мол- скотча__мм"][i]
        молярный_скотч_рас_на_1000_пр_шт2 = df["Молярный скотч __ расход на 1000 профиль__шт2"][i]
        термомост_1 = df["Термомост 1"][i]
        термомост_2 = df["Термомост 2"][i]
        термомост_3 = df["Термомост 3"][i]
        термомост_4 = df["Термомост 4"][i]
        ламинация_верх_a_ширина_ленты_мм = df["Ламинация __ верх A __ ширина ленты__мм"][i]
        лам_верх_a_рас_ленты_на_1000_пр_м2 = df["Ламинация __ верх A __ расход ленты на 1000 профилей__м²"][i]
        ламинация_низ_b_ширина_ленты_мм = df["Ламинация __ низ B __ ширина ленты__мм"][i]
        лам_низ_b_рас_ленты_на_1000_пр_м2 = df["Ламинация __ низ B __ расход ленты на 1000 профилей__м²"][i]
        ламинация_низ_c_ширина_ленты_мм = df["Ламинация __ низ C __ ширина ленты__мм"][i]
        лам_низ_c_рас_ленты_на_1000_пр_м2 = df["Ламинация __ низ C __ расход ленты на 1000 профилей__м²"][i]
        лам_рас_праймера_на_1000_штук_пр_кг = df["Ламинация __ расход праймера на 1000 штук профилей__кг"][i]
        лам_рас_клея_на_1000_штук_пр_кг = df["Ламинация __ расход клея на 1000 штук профилей__кг"][i]
        лам_рас_уп_материала_мешок_на_1000_пр = df["Ламинация __ Расход упаковочного материала (мешок) на 1000 профилей"][i]
        заш_пл_кг_м_akfa_верх_ширина_ленты_мм = df["Защитная пленка__кг__м Akfa __ верх ширина ленты__мм"][i]
        заш_пл_кг_м_akfa_бк_ст_ширина_ленты_мм = df["Защитная пленка__кг__м Akfa __ (Боковая сторона) ширина ленты__мм"][i]
        кг_м_ak_вр_и_кг_м_ak_бк_ст_рас_лн = df["Защитная пленка__кг__м Akfa __ верх и Защитная пленка__кг__м Akfa __ (Боковая сторона) расход ленты на 1000 профилей__м2"][i]
        заш_пл_кг_м_akfa_низ_ширина_ленты_мм = df["Защитная пленка__кг__м Akfa __ низ ширина ленты__мм"][i]
        заш_пл_кг_м_ak_низ_рас_лн_на_1000_пр_м2 = df["Защитная пленка__кг__м Akfa __ низ расход ленты на 1000 профиль__м2"][i]
        заш_пл_кг_м_retpen_верх_ширина_ленты_мм = df["Защитная пленка__кг__м RETPEN __ верх ширина ленты__мм"][i]
        заш_пл_кг_м_retpen_бк_ст_ширина_ленты = df["Защитная пленка__кг__м RETPEN __ (Боковая сторона) ширина ленты__мм"][i]
        кг_м_retpen_вр_и_кг_м_retpen_бк_ст_рас = df["Защитная пленка__кг__м RETPEN __ верх и Защитная пленка__кг__м RETPEN __ (Боковая сторона) расход ленты на 1000 профилей__м2"][i]
        заш_пл_кг_м_retpen_низ_ширина_ленты_мм = df["Защитная пленка__кг__м RETPEN __ низ ширина ленты__мм"][i]
        заш_пл_кг_м_retpen_низ_рас = df["Защитная пленка__кг__м RETPEN __ низ расход ленты на 1000 профиль__м2"][i]
        заш_пл_кг_м_benkam_жл_вр_ширина_лн_мм = df["Защитная пленка__кг__м BENKAM (желтый) __ верх ширина ленты__мм"][i]
        заш_пл_кг_м_benkam_жл_бк_ст_ширина_лн = df["Защитная пленка__кг__м BENKAM (желтый) __ (Боковая сторона) ширина ленты__мм"][i]
        кг_м_bn_жл_вр_и_кг_м_bn_жл_бк_ст_рас = df["Защитная пленка__кг__м BENKAM (желтый) __ верх и Защитная пленка__кг__м BENKAM (желтый) __ (Боковая сторона) расход ленты на 1000 профилей__м2"][i]
        заш_пл_кг_м_benkam_жл_низ_ширина_лн_мм = df["Защитная пленка__кг__м BENKAM (желтый) __ низ ширина ленты__мм"][i]
        заш_пл_кг_м_bn_жл_низ_рас = df["Защитная пленка__кг__м BENKAM (желтый) __ низ расход ленты на 1000 профиль__м2"][i]
        заш_пл_кг_м_ch_вр_ширина_лн_мм = df["Защитная пленка__кг__м IMZO CHEMPION __ верх ширина ленты__мм"][i]
        заш_пл_кг_м_ch_бк_ст_ширина_лн_мм = df["Защитная пленка__кг__м IMZO CHEMPION __ (Боковая сторона) ширина ленты__мм"][i]
        кг_м_ch_вр_и_кг_м_ch_бк_ст_рас = df["Защитная пленка__кг__м IMZO CHEMPION __ верх и Защитная пленка__кг__м IMZO CHEMPION __ (Боковая сторона) расход ленты на 1000 профилей__м2"][i]
        заш_пл_кг_м_ch_низ_ширина_лн_мм = df["Защитная пленка__кг__м IMZO CHEMPION __ низ ширина ленты__мм"][i]
        заш_пл_кг_м_ch_низ_рас_лн_на_1000_пр_м2 = df["Защитная пленка__кг__м IMZO CHEMPION __ низ расход ленты на 1000 профиль__м2"][i]
        заш_пл_кг_м_imzo_akfa_вр_ширина_лн_мм = df["Защитная пленка__кг__м IMZO AKFA __ верх ширина ленты__мм"][i]
        заш_пл_кг_м_imzo_akfa_бк_ст_ширина_лн = df["Защитная пленка__кг__м IMZO AKFA __ (Боковая сторона) ширина ленты__мм"][i]
        кг_м_imzo_ak_вр_и_кг_м_imzo_ak_бк_ст = df["Защитная пленка__кг__м IMZO AKFA __ верх и Защитная пленка__кг__м IMZO AKFA __ (Боковая сторона) расход ленты на 1000 профилей__м2"][i]
        заш_пл_кг_м_imzo_akfa_низ_ширина_лн_мм = df["Защитная пленка__кг__м IMZO AKFA __ низ ширина ленты__мм"][i]
        заш_пл_кг_м_imzo_ak_низ_рас = df["Защитная пленка__кг__м IMZO AKFA __ низ расход ленты на 1000 профиль__м2"][i]
        заш_пл_кг_м_без_бр_вр_ширина_лн_мм = df["Защитная пленка__кг__м Без бренд __ верх ширина ленты__мм"][i]
        заш_пл_кг_м_без_бр_бк_ст_ширина_лн_мм = df["Защитная пленка__кг__м Без бренд __ (Боковая сторона) ширина ленты__мм"][i]
        кг_м_без_бр_вр_и_кг_м_без_бр_бк_ст_рас = df["Защитная пленка__кг__м Без бренд __ верх и Защитная пленка__кг__м Без бренд __ (Боковая сторона) расход ленты на 1000 профилей__м2"][i]
        заш_пл_кг_м_без_бр_низ_ширина_лн_мм = df["Защитная пленка__кг__м Без бренд __ низ ширина ленты__мм"][i]
        заш_пл_кг_м_без_бр_низ_рас = df["Защитная пленка__кг__м Без бренд __ низ расход ленты на 1000 профиль__м2"][i]
        заш_пл_кг_м_eng_верх_ширина_ленты_мм = df["Защитная пленка__кг__м Engelberg __ верх ширина ленты__мм"][i]
        заш_пл_кг_м_eng_бк_ст_ширина_ленты_мм = df["Защитная пленка__кг__м Engelberg __ (Боковая сторона) ширина ленты__мм"][i]
        кг_м_eng_вр_и_кг_м_eng_бк_ст_рас = df["Защитная пленка__кг__м Engelberg __ верх и Защитная пленка__кг__м Engelberg __ (Боковая сторона) расход ленты на 1000 профилей__м2"][i]
        заш_пл_кг_м_eng_низ_ширина_ленты_мм = df["Защитная пленка__кг__м Engelberg __ низ ширина ленты__мм"][i]
        заш_пл_кг_м_eng_низ_рас_лн_на_1000_пр = df["Защитная пленка__кг__м Engelberg __ низ расход ленты на 1000 профиль__м2"][i]
        заш_пл_кг_м_eng_qora_вр_ширина_лн_мм = df["Защитная пленка__кг__м Engelberg (QORA) __ верх ширина ленты__мм"][i]
        заш_пл_кг_м_eng_qora_бк_ст_ширина_лн_мм = df["Защитная пленка__кг__м Engelberg (QORA) __ (Боковая сторона) ширина ленты__мм"][i]
        кг_м_eng_qora_вр_и_кг_м_eng_qora_бк_ст = df["Защитная пленка__кг__м Engelberg (QORA) __ верх и Защитная пленка__кг__м Engelberg (QORA) __ (Боковая сторона) расход ленты на 1000 профилей__м2"][i]
        заш_пл_кг_м_eng_qora_низ_ширина_ленты = df["Защитная пленка__кг__м Engelberg (QORA) __ низ ширина ленты__мм"][i]
        заш_пл_кг_м_eng_qora_низ_рас = df["Защитная пленка__кг__м Engelberg (QORA) __ низ расход ленты на 1000 профиль__м2"][i]
        уп_пол_лента_ширина_уп_ленты_мм = df["Упаковочная полиэтиленовая лента __ ширина упоковочной ленты__мм"][i]
        уп_пол_лн_рас_уп_лн_на_1000_штук_кг = df["Упаковочная полиэтиленовая лента __ расход упоковочной ленты на 1000 штук __кг"][i]
        расход_скотча_ширина_скотча_мм = df["Расход скотча __ ширина скотча__мм"][i]
        рас_скотча_рас_скотча_на_1000_штук_шт = df["Расход скотча __ расход скотча на 1000 штук __Шт"][i]
        упаковка_колво_профилей_в_1_пачке = df["Упаковка __ Кол-во профилей в 1- пачке"][i]
        ala7_oddiy_ala8_qora_алю_сплав_6064 = df["AL-A7 (Oddiy) __ AL-A8 (Qora) Алюминиевый сплав 6064"][i]

        # print(len(ala7_oddiy_ala8_qora_алю_сплав_6064))
      
        Norma(
        устаревший =устаревший,  
        компонент_1 =компонент_1,  
        компонент_2 =компонент_2,  
        компонент_3 =компонент_3,  
        артикул =артикул,  
        серия =серия,  
        наименование =наименование,  
        внешний_периметр_профиля_мм =внешний_периметр_профиля_мм,  
        площадь_мм21 =площадь_мм21,  
        площадь_мм22 =площадь_мм22,  
        удельный_вес_профиля_кг_м =удельный_вес_профиля_кг_м,  
        диаметр_описанной_окружности_мм =диаметр_описанной_окружности_мм,  
        длина_профиля_м =длина_профиля_м,  
        расчетное_колво_профиля_шт =расчетное_колво_профиля_шт,  
        общий_вес_профиля_кг =общий_вес_профиля_кг,  
        алю_сп_6063_рас_спа_на_1000_шт_пр_кг =алю_сп_6063_рас_спа_на_1000_шт_пр_кг,  
        алю_сплав_6063_при_этом_тех_отхода1 =алю_сплав_6063_при_этом_тех_отхода1,  
        алю_сплав_6063_при_этом_тех_отхода2 =алю_сплав_6063_при_этом_тех_отхода2,  
        смазка_для_пресса_кг_графитовая =смазка_для_пресса_кг_графитовая,  
        смазка_для_пресса_кг_пилы_хл_резки_сол =смазка_для_пресса_кг_пилы_хл_резки_сол,  
        смазка_для_пресса_кг_горячей_резки_сол =смазка_для_пресса_кг_горячей_резки_сол,  
        смазка_для_пресса_кг_графитовые_плиты =смазка_для_пресса_кг_графитовые_плиты,  
        хим_пг_к_окр_politeknik_кг_pol_ac_25p =хим_пг_к_окр_politeknik_кг_pol_ac_25p,  
        хим_пг_к_окр_politeknik_кг_alupol_сr_51 =хим_пг_к_окр_politeknik_кг_alupol_сr_51,  
        хим_пг_к_окр_politeknik_кг_alupol_ac_52 =хим_пг_к_окр_politeknik_кг_alupol_ac_52,  
        пр_краситель_толщина_пк_мкм =пр_краситель_толщина_пк_мкм,  
        порошковый_краситель_рас_кг_на_1000_пр =порошковый_краситель_рас_кг_на_1000_пр,  
        пр_краситель_при_этом_тех_отхода  =пр_краситель_при_этом_тех_отхода ,  
        не_нужний =не_нужний,  
        суб_ширина_декор_пленки_мм_зол_дуб =суб_ширина_декор_пленки_мм_зол_дуб,  
        сублимация_расход_на_1000_профиль_м21 =сублимация_расход_на_1000_профиль_м21,  
        суб_ширина_декор_пленки_мм_3д_313701 =суб_ширина_декор_пленки_мм_3д_313701,  
        сублимация_расход_на_1000_профиль_м22 =сублимация_расход_на_1000_профиль_м22,  
        суб_ширина_декор_пленки_мм_дуб_мокко =суб_ширина_декор_пленки_мм_дуб_мокко,  
        сублимация_расход_на_1000_профиль_м23 =сублимация_расход_на_1000_профиль_м23,  
        суб_ширина_декор_пленки_мм_3д_313702 =суб_ширина_декор_пленки_мм_3д_313702,  
        сублимация_расход_на_1000_профиль_м24 =сублимация_расход_на_1000_профиль_м24,  
        молярный_скотч_ширина1_мол_скотча_мм =молярный_скотч_ширина1_мол_скотча_мм,   
        молярный_скотч_рас_на_1000_пр_шт1 =молярный_скотч_рас_на_1000_пр_шт1,  
        молярный_скотч_ширина2_мол_скотча_мм =молярный_скотч_ширина2_мол_скотча_мм,   
        молярный_скотч_рас_на_1000_пр_шт2 =молярный_скотч_рас_на_1000_пр_шт2,  
        термомост_1 =термомост_1,  
        термомост_2 =термомост_2,  
        термомост_3 =термомост_3,  
        термомост_4 =термомост_4,  
        ламинация_верх_a_ширина_ленты_мм =ламинация_верх_a_ширина_ленты_мм,  
        лам_верх_a_рас_ленты_на_1000_пр_м2 =лам_верх_a_рас_ленты_на_1000_пр_м2,  
        ламинация_низ_b_ширина_ленты_мм =ламинация_низ_b_ширина_ленты_мм,  
        лам_низ_b_рас_ленты_на_1000_пр_м2 =лам_низ_b_рас_ленты_на_1000_пр_м2,  
        ламинация_низ_c_ширина_ленты_мм =ламинация_низ_c_ширина_ленты_мм,  
        лам_низ_c_рас_ленты_на_1000_пр_м2 =лам_низ_c_рас_ленты_на_1000_пр_м2,  
        лам_рас_праймера_на_1000_штук_пр_кг =лам_рас_праймера_на_1000_штук_пр_кг,  
        лам_рас_клея_на_1000_штук_пр_кг =лам_рас_клея_на_1000_штук_пр_кг,  
        лам_рас_уп_материала_мешок_на_1000_пр =лам_рас_уп_материала_мешок_на_1000_пр,  
        заш_пл_кг_м_akfa_верх_ширина_ленты_мм =заш_пл_кг_м_akfa_верх_ширина_ленты_мм,  
        заш_пл_кг_м_akfa_бк_ст_ширина_ленты_мм =заш_пл_кг_м_akfa_бк_ст_ширина_ленты_мм,  
        кг_м_ak_вр_и_кг_м_ak_бк_ст_рас_лн =кг_м_ak_вр_и_кг_м_ak_бк_ст_рас_лн,  
        заш_пл_кг_м_akfa_низ_ширина_ленты_мм =заш_пл_кг_м_akfa_низ_ширина_ленты_мм,  
        заш_пл_кг_м_ak_низ_рас_лн_на_1000_пр_м2 =заш_пл_кг_м_ak_низ_рас_лн_на_1000_пр_м2,  
        заш_пл_кг_м_retpen_верх_ширина_ленты_мм =заш_пл_кг_м_retpen_верх_ширина_ленты_мм,  
        заш_пл_кг_м_retpen_бк_ст_ширина_ленты =заш_пл_кг_м_retpen_бк_ст_ширина_ленты,  
        кг_м_retpen_вр_и_кг_м_retpen_бк_ст_рас =кг_м_retpen_вр_и_кг_м_retpen_бк_ст_рас,  
        заш_пл_кг_м_retpen_низ_ширина_ленты_мм =заш_пл_кг_м_retpen_низ_ширина_ленты_мм,  
        заш_пл_кг_м_retpen_низ_рас  =заш_пл_кг_м_retpen_низ_рас ,  
        заш_пл_кг_м_benkam_жл_вр_ширина_лн_мм  =заш_пл_кг_м_benkam_жл_вр_ширина_лн_мм ,  
        заш_пл_кг_м_benkam_жл_бк_ст_ширина_лн =заш_пл_кг_м_benkam_жл_бк_ст_ширина_лн,  
        кг_м_bn_жл_вр_и_кг_м_bn_жл_бк_ст_рас =кг_м_bn_жл_вр_и_кг_м_bn_жл_бк_ст_рас,  
        заш_пл_кг_м_benkam_жл_низ_ширина_лн_мм =заш_пл_кг_м_benkam_жл_низ_ширина_лн_мм,  
        заш_пл_кг_м_bn_жл_низ_рас =заш_пл_кг_м_bn_жл_низ_рас,  
        заш_пл_кг_м_ch_вр_ширина_лн_мм =заш_пл_кг_м_ch_вр_ширина_лн_мм,  
        заш_пл_кг_м_ch_бк_ст_ширина_лн_мм =заш_пл_кг_м_ch_бк_ст_ширина_лн_мм,  
        кг_м_ch_вр_и_кг_м_ch_бк_ст_рас =кг_м_ch_вр_и_кг_м_ch_бк_ст_рас,  
        заш_пл_кг_м_ch_низ_ширина_лн_мм =заш_пл_кг_м_ch_низ_ширина_лн_мм,  
        заш_пл_кг_м_ch_низ_рас_лн_на_1000_пр_м2 =заш_пл_кг_м_ch_низ_рас_лн_на_1000_пр_м2,  
        заш_пл_кг_м_imzo_akfa_вр_ширина_лн_мм =заш_пл_кг_м_imzo_akfa_вр_ширина_лн_мм,  
        заш_пл_кг_м_imzo_akfa_бк_ст_ширина_лн =заш_пл_кг_м_imzo_akfa_бк_ст_ширина_лн,  
        кг_м_imzo_ak_вр_и_кг_м_imzo_ak_бк_ст =кг_м_imzo_ak_вр_и_кг_м_imzo_ak_бк_ст,  
        заш_пл_кг_м_imzo_akfa_низ_ширина_лн_мм =заш_пл_кг_м_imzo_akfa_низ_ширина_лн_мм,  
        заш_пл_кг_м_imzo_ak_низ_рас =заш_пл_кг_м_imzo_ak_низ_рас,  
        заш_пл_кг_м_без_бр_вр_ширина_лн_мм =заш_пл_кг_м_без_бр_вр_ширина_лн_мм,  
        заш_пл_кг_м_без_бр_бк_ст_ширина_лн_мм =заш_пл_кг_м_без_бр_бк_ст_ширина_лн_мм,  
        кг_м_без_бр_вр_и_кг_м_без_бр_бк_ст_рас =кг_м_без_бр_вр_и_кг_м_без_бр_бк_ст_рас,  
        заш_пл_кг_м_без_бр_низ_ширина_лн_мм =заш_пл_кг_м_без_бр_низ_ширина_лн_мм,  
        заш_пл_кг_м_без_бр_низ_рас =заш_пл_кг_м_без_бр_низ_рас,  
        заш_пл_кг_м_eng_верх_ширина_ленты_мм =заш_пл_кг_м_eng_верх_ширина_ленты_мм,  
        заш_пл_кг_м_eng_бк_ст_ширина_ленты_мм =заш_пл_кг_м_eng_бк_ст_ширина_ленты_мм,  
        кг_м_eng_вр_и_кг_м_eng_бк_ст_рас =кг_м_eng_вр_и_кг_м_eng_бк_ст_рас,  
        заш_пл_кг_м_eng_низ_ширина_ленты_мм =заш_пл_кг_м_eng_низ_ширина_ленты_мм,  
        заш_пл_кг_м_eng_низ_рас_лн_на_1000_пр =заш_пл_кг_м_eng_низ_рас_лн_на_1000_пр,  
        заш_пл_кг_м_eng_qora_вр_ширина_лн_мм =заш_пл_кг_м_eng_qora_вр_ширина_лн_мм,  
        заш_пл_кг_м_eng_qora_бк_ст_ширина_лн_мм =заш_пл_кг_м_eng_qora_бк_ст_ширина_лн_мм,  
        кг_м_eng_qora_вр_и_кг_м_eng_qora_бк_ст =кг_м_eng_qora_вр_и_кг_м_eng_qora_бк_ст,  
        заш_пл_кг_м_eng_qora_низ_ширина_ленты =заш_пл_кг_м_eng_qora_низ_ширина_ленты,  
        заш_пл_кг_м_eng_qora_низ_рас =заш_пл_кг_м_eng_qora_низ_рас,  
        уп_пол_лента_ширина_уп_ленты_мм =уп_пол_лента_ширина_уп_ленты_мм,  
        уп_пол_лн_рас_уп_лн_на_1000_штук_кг =уп_пол_лн_рас_уп_лн_на_1000_штук_кг,  
        расход_скотча_ширина_скотча_мм =расход_скотча_ширина_скотча_мм,  
        рас_скотча_рас_скотча_на_1000_штук_шт =рас_скотча_рас_скотча_на_1000_штук_шт,  
        упаковка_колво_профилей_в_1_пачке =упаковка_колво_профилей_в_1_пачке,  
        ala7_oddiy_ala8_qora_алю_сплав_6064 =ala7_oddiy_ala8_qora_алю_сплав_6064
        ).save()  
    
    
    return redirect('index')

    
def receipt_all(request):
    ########## Nakleyka
    df = pd.read_excel('C:\\OpenServer\\domains\\Норма для ИТ-1 (2).xlsx','Наклейка')
    df =df.astype(str)
    
    for i in range(0,df.shape[0]):
        sap_code_s4q100 = df['SAP code S4Q100'][i]
        название = df['Название'][i]
        еи = df['ЕИ'][i]
        склад_закупа = df['Склад закупа'][i]
        код_наклейки = df['Код наклейки'][i]
        название_наклейки = df['название наклейки'][i]
        ширина = df['Ширина'][i]
        еи_ширины = df['ЕИ ширины'][i]
        тип_клея = df['Тип клея '][i]
        Nakleyka(
            sap_code_s4q100 = sap_code_s4q100, 
            название = название, 
            еи = еи, 
            склад_закупа = склад_закупа, 
            код_наклейки = код_наклейки, 
            название_наклейки = название_наклейки, 
            ширина = ширина, 
            еи_ширины = еи_ширины, 
            тип_клея = тип_клея
            ).save()
    ######end Nakleyka
    print('nakleyka tugadi')
    ########## Краска
    df = pd.read_excel('C:\\OpenServer\\domains\\Норма для ИТ-1 (2).xlsx','Краска')
    df =df.astype(str)
    
    for i in range(0,df.shape[0]):
        sap_code_s4q100 = df['SAP code S4Q100'][i]
        название = df['Название'][i]
        еи = df['ЕИ'][i]
        склад_закупа = df['Склад закупа'][i]
        бренд_краски = df['Бренд краски'][i]
        код_краски = df['Код краски'][i]
        тип_краски = df['тип краски'][i]
        код_краски_в_профилях = df['Код краски в профилях'][i]
        Kraska(
        sap_code_s4q100 = sap_code_s4q100, 
        название = название, 
        еи = еи, 
        склад_закупа = склад_закупа, 
        бренд_краски = бренд_краски, 
        код_краски = код_краски, 
        тип_краски = тип_краски, 
        код_краски_в_профилях = код_краски_в_профилях 
            ).save()

    ######end Nakleyka
    print('kraska tugadi')
    ########## химикаты
    df = pd.read_excel('C:\\OpenServer\\domains\\Норма для ИТ-1 (2).xlsx','химикаты')
    df =df.astype(str)
    
    for i in range(0,df.shape[0]):
        sap_code_s4q100 = df['SAP code S4Q100'][i]
        название = df['Название'][i]
        еи = df['ЕИ'][i]
        склад_закупа = df['Склад закупа'][i]
        Ximikat(
        sap_code_s4q100 =sap_code_s4q100, 
        название =название, 
        еи =еи, 
        склад_закупа =склад_закупа 
            ).save()

    ######end химикаты
    print('ximikat tugadi')
    ########## Суб декор пленка
    df = pd.read_excel('C:\\OpenServer\\domains\\Норма для ИТ-1 (2).xlsx','Суб декор пленка')
    df =df.astype(str)
    
    for i in range(0,df.shape[0]):
        sap_code_s4q100 = df['SAP code S4Q100'][i]
        название = df['Название'][i]
        еи = df['ЕИ'][i]
        склад_закупа = df['Склад закупа'][i]
        код_декор_пленки = df['Код декор пленки'][i]
        ширина_декор_пленки_мм = df['ширина декор пленки/мм'][i]
        SubDekorPlonka(
        sap_code_s4q100 = sap_code_s4q100, 
        название = название, 
        еи = еи, 
        склад_закупа = склад_закупа, 
        код_декор_пленки = код_декор_пленки, 
        ширина_декор_пленки_мм = ширина_декор_пленки_мм 
            ).save()

    ######end Nakleyka
    print('subdekor tugadi')
    ########## скотч
    df = pd.read_excel('C:\\OpenServer\\domains\\Норма для ИТ-1 (2).xlsx','скотч')
    df =df.astype(str)
    
    for i in range(0,df.shape[0]):
        sap_code_s4q100 = df['SAP code S4Q100'][i]
        название = df['Название'][i]
        еи = df['ЕИ'][i]
        склад_закупа = df['Склад закупа'][i]
        Skotch(
        sap_code_s4q100 = sap_code_s4q100, 
        название = название, 
        еи = еи, 
        склад_закупа = склад_закупа 
            ).save()

    ######end скотч
    print('skotch tugadi')
    ########## Лам пленка
    df = pd.read_excel('C:\\OpenServer\\domains\\Норма для ИТ-1 (2).xlsx','Лам пленка')
    df =df.astype(str)
    
    for i in range(0,df.shape[0]):
        sap_code_s4q100 = df['SAP code S4Q100'][i]
        название = df['Название'][i]
        еи = df['ЕИ'][i]
        склад_закупа = df['Склад закупа'][i]
        код_лам_пленки = df['Код лам пленки'][i]
        Lamplonka(
        sap_code_s4q100 = sap_code_s4q100, 
        название = название, 
        еи = еи, 
        склад_закупа = склад_закупа, 
        код_лам_пленки = код_лам_пленки 
            ).save()

    ######end Nakleyka
    print('lam plyon tugadi')
    ########## клей для лам
    df = pd.read_excel('C:\\OpenServer\\domains\\Норма для ИТ-1 (2).xlsx','клей для лам')
    df =df.astype(str)
    
    for i in range(0,df.shape[0]):
        sap_code_s4q100 = df['SAP code S4Q100'][i]
        название = df['Название'][i]
        еи = df['ЕИ'][i]
        склад_закупа = df['Склад закупа'][i]
        KleyDlyaLamp(
        sap_code_s4q100 = sap_code_s4q100, 
        название = название, 
        еи = еи, 
        склад_закупа = склад_закупа 
            ).save()

    ######end Nakleyka
    print('kley dlya lam tugadi')
    ########## Алю цилиндр и для экструзии1
    df = pd.read_excel('C:\\OpenServer\\domains\\Норма для ИТ-1 (2).xlsx','Алю цилиндр и для экструзии1')
    df =df.astype(str)
    
    for i in range(0,df.shape[0]):
        sap_code_s4q100 = df['SAP code S4Q100'][i]
        название = df['Название'][i]
        еи = df['ЕИ'][i]
        склад_закупа = df['Склад закупа'][i]
        тип = df['ТИП'][i]
        AlyuminniysilindrEkstruziya1(
        sap_code_s4q100 = sap_code_s4q100, 
        название = название, 
        еи = еи, 
        склад_закупа = склад_закупа, 
        тип = тип 
            ).save()

    ######end Nakleyka
    print('alu silind dlya ekst1 tugadi')
    ########## Алю цилиндр и для экструзии2
    df = pd.read_excel('C:\\OpenServer\\domains\\Норма для ИТ-1 (2).xlsx','Алю цилиндр и для экструзии2')
    df =df.astype(str)
    
    for i in range(0,df.shape[0]):
        sap_code_s4q100 = df['SAP code S4Q100'][i]
        название = df['Название'][i]
        еи = df['ЕИ'][i]
        склад_закупа = df['Склад закупа'][i]
        AlyuminniysilindrEkstruziya2(
        sap_code_s4q100 = sap_code_s4q100, 
        название = название, 
        еи = еи, 
        склад_закупа = склад_закупа
            ).save()

    ######end Nakleyka
    print('alu silind dlya ekst2 tugadi')
    ########## Термомост для термо
    df = pd.read_excel('C:\\OpenServer\\domains\\Норма для ИТ-1 (2).xlsx','Термомост для термо')
    df =df.astype(str)
    
    for i in range(0,df.shape[0]):
        sap_code_s4q100 = df['SAP code S4Q100'][i]
        название = df['Название'][i]
        еи = df['ЕИ'][i]
        склад_закупа = df['Склад закупа'][i]
        TermomostDlyaTermo(
        sap_code_s4q100 = sap_code_s4q100,
        название = название,
        еи = еи,
        склад_закупа = склад_закупа
            ).save()

    ######end Nakleyka
    print('termomost dlya termo tugadi')
    ########## Сырьё Упаковки
    df = pd.read_excel('C:\\OpenServer\\domains\\Норма для ИТ-1 (2).xlsx','Сырьё Упаковки')
    df =df.astype(str)
    
    for i in range(0,df.shape[0]):
        sap_code_s4q100 = df['SAP code S4Q100'][i]
        название = df['Название'][i]
        еи = df['ЕИ'][i]
        склад_закупа = df['Склад закупа'][i]
        SiryoDlyaUpakovki(
        sap_code_s4q100 = sap_code_s4q100, 
        название = название, 
        еи = еи, 
        склад_закупа = склад_закупа
            ).save()

    ######end Nakleyka
    print('siryo dlya upakovki tugadi')
    ########## Прочие сырьё ненормированный
    df = pd.read_excel('C:\\OpenServer\\domains\\Норма для ИТ-1 (2).xlsx','Прочие сырьё ненормированный')
    df =df.astype(str)
    
    for i in range(0,df.shape[0]):
        sap_code_s4q100 = df['SAP code S4Q100'][i]
        название = df['Название'][i]
        еи = df['ЕИ'][i]
        склад_закупа = df['Склад закупа'][i]
        ProchiyeSiryoNeno(
        sap_code_s4q100 = sap_code_s4q100, 
        название = название, 
        еи = еи, 
        склад_закупа = склад_закупа
            ).save()

    ######end Nakleyka
    print('prochiye siryo tugadi')
    
    return JsonResponse({'Hammasi bo\'ldi':'ok'})


def norma_add(request):
    df = {}
    
    

def file_upload(request): 
  if request.method == 'POST':
    form = NormaFileForm(request.POST, request.FILES)
    if form.is_valid():
        form.save()
        return redirect('norma_file_list')
  else:
      form =NormaFileForm()
      context ={
        'form':form
      }
  return render(request,'norma/excel_form.html',context)

def file_list(request):
    files = NormaExcelFiles.objects.filter(generated =False)
    context ={'files':files}
    return render(request,'norma/file_list.html',context)

def process(request,id):
    # file = NormaExcelFiles.objects.get(id=id).file
    # file_path =f'{MEDIA_ROOT}\\{file}'
    # df = pd.read_excel(file_path)
    # df =df.astype(str)
    df =[
        ['WD450402-E001',	'63T4 L6020 MF'],
        ['WD450402-E001',	'63T4 L6020 MF'],
        ['WD450402-E001',	'63T4 L6020 MF'],
        ['WD450403-E001',	'63T4 L6020 MF'],
        ['WD450403-E001',	'63T4 L6020 MF'],
        ['WD450403-E002',	'63T4 L5000 MF']
        ]
    
    df_new ={
        'ID':[],
        'MATNR': [],
        'WERKS':[],
        'TEXT1':[],
        'STLAL':[],
        'STLAN':[],
        'ZTEXT':[],
        'STKTX':[],
        'BMENG':[],
        'BMEIN':[],
        'STLST':[],
        'POSNR':[],
        'POSTP':[],
        'MATNR1':[],
        'TEXT2':[],
        'MEINS':[],
        'MENGE':[],
        'DATUV':[],
        'PUSTOY':[],
        'LGORT':[]
    }
    
    j=0
    schotchi = True
    for i in range(0,len(df)):
        
        df_new['ID'].append('1')
        # df_new['MATNR'] = df['SAP код Экструзия холодная резка'][i].split('-')[0]
        df_new['MATNR'].append(df[i][0].split('-')[0])
        df_new['WERKS'].append(1101)
        # df_new['TEXT1'].append(df['Экструзия холодная резка'][i])
        df_new['TEXT1'].append(df[i][1])
        df_new['STLAL'].append('1')
        df_new['STLAN'].append('1')
        if df[i][0].split('-')[1][:1]=='E':
            ztekst ='Экструзия (пресс) + Пила'
        df_new['ZTEXT'].append(ztekst)
        df_new['STKTX'].append( 0)
        df_new['BMENG'].append( '1000')
        df_new['BMEIN'].append('ШТ')
        df_new['STLST'].append('1')
        df_new['POSNR'].append('')
        df_new['POSTP'].append('')
        df_new['MATNR1'].append('')
        df_new['TEXT2'].append('')
        df_new['MEINS'].append('')
        df_new['MENGE'].append('')
        df_new['DATUV'].append('01012021')
        df_new['PUSTOY'].append('')
        df_new['LGORT'].append('')
        length = df[i][0].split('-')[0]
        index1 =j
        alum_teks = Norma.objects.filter(Q(компонент_1=length)|Q(компонент_2=length)|Q(компонент_3=length)|Q(артикул=length))[:1].get()
        for k in range(1,6):
            j+=1
            df_new['ID'].append('')
            df_new['MATNR'].append('')
            df_new['WERKS'].append('')
            df_new['TEXT1'].append('')
            df_new['STLAL'].append('')
            df_new['STLAN'].append('')
            df_new['ZTEXT'].append('')
            df_new['STKTX'].append('')
            df_new['BMENG'].append('')
            df_new['BMEIN'].append('')
            df_new['STLST'].append('')
            df_new['POSNR'].append(k)
            df_new['POSTP'].append('L')
            
            
            if k == 1 :
                
                print(f'{index1}  qiymati = {df_new[index1]}')
                
                if df_new['STLAL'][index1] == '1':
                    aliminisi =AlyuminniysilindrEkstruziya1.objects.filter(тип =alum_teks.ala7_oddiy_ala8_qora_алю_сплав_6064)[:1].get()
                    print('sikl1 ')
                    
                    df_new['MATNR1'].append(aliminisi.sap_code_s4q100)
                    df_new['TEXT2'].append(aliminisi.название)
                
                df_new['MEINS'].append(alum_teks.алю_сп_6063_рас_спа_на_1000_шт_пр_кг)
                df_new['MENGE'].append('КГ')
                df_new['DATUV'].append('')
                df_new['PUSTOY'].append('')
              
            if k==2:
                alummm = AlyuminniysilindrEkstruziya2.objects.get(id=1)
                print('sikl2 ')
                df_new['MATNR1'].append(alummm.sap_code_s4q100)
                df_new['TEXT2'].append(alummm.название)
                df_new['MENGE'].append(alummm.еи)
                
                df_new['MEINS'].append( alum_teks.смазка_для_пресса_кг_графитовая)
                df_new['DATUV'].append('')
                df_new['PUSTOY'].append('')
            if k==3:
                alummm = AlyuminniysilindrEkstruziya2.objects.get(id=2)
                print('sikl3 ')
                df_new['MATNR1'].append(alummm.sap_code_s4q100)
                df_new['TEXT2'].append(alummm.название)
                df_new['MENGE'].append(alummm.еи)
                
                df_new['MEINS'].append(float(alum_teks.смазка_для_пресса_кг_пилы_хл_резки_сол) + float(alum_teks.смазка_для_пресса_кг_горячей_резки_сол))
                df_new['DATUV'].append('')
                df_new['PUSTOY'].append('')
            if k == 4:
                alummm = AlyuminniysilindrEkstruziya2.objects.get(id=3)
                print('sikl4 ')
                df_new['MATNR1'].append(alummm.sap_code_s4q100)
                df_new['TEXT2'].append(alummm.название)
                df_new['MENGE'].append(alummm.еи)
                
                df_new['MEINS'].append( alum_teks.смазка_для_пресса_кг_графитовые_плиты)
                df_new['DATUV'].append('')
                df_new['PUSTOY'].append('')
            if k == 5:
                alummm = AlyuminniysilindrEkstruziya2.objects.get(id=4)
                print('sikl5 ')
                df_new['MATNR1'].append(alummm.sap_code_s4q100)
                df_new['TEXT2'].append(alummm.название)
                df_new['MENGE'].append(alummm.еи)
                
                df_new['MEINS'].append( (-1)*(float(alum_teks.алю_сплав_6063_при_этом_тех_отхода1)+float(alum_teks.алю_сплав_6063_при_этом_тех_отхода2)))
                df_new['DATUV'].append('')
                df_new['PUSTOY'].append('')
                
            df_new['LGORT'].append('PS01')
        # df_new['STKTX'][j-5].append(df_new['TEXT2'][j-4])
        
        j+=1
        df_new['ID'].append( 1)
        df_new['MATNR'].append( df[i][0].split('-')[0])
        df_new['WERKS'].append( 1101)
        df_new['TEXT1'].append( df[i][1])
        df_new['STLAL'].append('2')
        df_new['STLAN'].append( 1)
        if df[i][0].split('-')[1][:1]=='E':
            ztekst='Экструзия (пресс) + Пила'
        df_new['ZTEXT'].append( ztekst)
        df_new['STKTX'].append( 0)
        df_new['BMENG'].append( '1000')
        df_new['BMEIN'].append('ШТ')
        df_new['STLST'].append(1)
        df_new['POSNR'].append('')
        df_new['POSTP'].append('')
        df_new['MATNR1'].append('')
        df_new['TEXT2'].append('')
        df_new['MEINS'].append('')
        df_new['MENGE'].append('')
        df_new['DATUV'].append('01012021')
        df_new['PUSTOY'].append('')
        df_new['LGORT'].append('')
        length = df[i][0].split('-')[0]
        index2 =j
        alum_teks = Norma.objects.filter(Q(компонент_1=length)|Q(компонент_2=length)|Q(компонент_3=length)|Q(артикул=length))[:1].get()
        for k in range(1,6):
            j+=1
            df_new['ID'].append( '')
            df_new['MATNR'].append( '')
            df_new['WERKS'].append( '')
            df_new['TEXT1'].append( '')
            df_new['STLAL'].append( '')
            df_new['STLAN'].append( '')
            df_new['ZTEXT'].append( '')
            df_new['STKTX'].append( '')
            df_new['BMENG'].append( '')
            df_new['BMEIN'].append('')
            df_new['STLST'].append('')
            df_new['POSNR'].append(k)
            df_new['POSTP'].append('L')
            
            
            if k == 1 :
                print(f'{index2}  qiymati = {df_new[index2]}')
                if df_new['STLAL'][j-k] =='2':
                    print('sikl 1 2 ')
                    print(alum_teks.ala7_oddiy_ala8_qora_алю_сплав_6064)
                    aliminisi =AlyuminniysilindrEkstruziya1.objects.filter(тип =alum_teks.ala7_oddiy_ala8_qora_алю_сплав_6064)[:1].get()
                    df_new['MATNR1'].append(aliminisi.sap_code_s4q100)
                    df_new['TEXT2'].append(aliminisi.название)
                
                df_new['MEINS'].append( alum_teks.алю_сп_6063_рас_спа_на_1000_шт_пр_кг)
                df_new['MENGE'].append( 'КГ')
                df_new['DATUV'].append('')
                df_new['PUSTOY'].append('')
              
            if k==2:
                alummm = AlyuminniysilindrEkstruziya2.objects.first()
                print('sikl 2 2 ')
                df_new['MATNR1'].append(alummm.sap_code_s4q100)
                df_new['TEXT2'].append(alummm.название)
                df_new['MENGE'].append(alummm.еи)
                
                df_new['MEINS'].append( alum_teks.смазка_для_пресса_кг_графитовая)
                df_new['DATUV'].append('')
                df_new['PUSTOY'].append('')
            if k==3:
                print('sikl 2 3 ')
                alummm = AlyuminniysilindrEkstruziya2.objects.get(id=2)
                df_new['MATNR1'].append(alummm.sap_code_s4q100)
                df_new['TEXT2'].append(alummm.название)
                df_new['MENGE'].append(alummm.еи)
                
                df_new['MEINS'].append( float(alum_teks.смазка_для_пресса_кг_пилы_хл_резки_сол) + float(alum_teks.смазка_для_пресса_кг_горячей_резки_сол))
                df_new['DATUV'].append('')
                df_new['PUSTOY'].append('')
            if k == 4:
                print('sikl 2 4 ')
                alummm = AlyuminniysilindrEkstruziya2.objects.get(id=3)
                df_new['MATNR1'].append(alummm.sap_code_s4q100)
                df_new['TEXT2'].append(alummm.название)
                df_new['MENGE'].append(alummm.еи)
                
                df_new['MEINS'].append( alum_teks.смазка_для_пресса_кг_графитовые_плиты)
                df_new['DATUV'].append('')
                df_new['PUSTOY'].append('')
            if k == 5:
                print('sikl 2 5 ')
                alummm = AlyuminniysilindrEkstruziya2.objects.get(id=4)
                df_new['MATNR1'].append(alummm.sap_code_s4q100)
                df_new['TEXT2'].append(alummm.название)
                df_new['MENGE'].append(alummm.еи)
                
                df_new['MEINS'].append( (-1)*(float(alum_teks.алю_сплав_6063_при_этом_тех_отхода1)+float(alum_teks.алю_сплав_6063_при_этом_тех_отхода2)))
                df_new['DATUV'].append('')
                df_new['PUSTOY'].append('')
                
            df_new['LGORT'].append('PS01')
        # df_new['STKTX'][j-5] = df_new['TEXT2'][j-4]
    for key,val in df_new.items():
        print(key,len(val)) 
    # print(df_new)
    # dff =pd.DataFrame(df_new)
    # dff.to_excel('C:\\Users\\Acer\\Desktop\\new_base.xlxs')
    return JsonResponse({'a':'b'})
    # j=0
    # for i in range(0,len(df)):
    #     df_new['ID'].append(1)
    #     # df_new['MATNR'][j] = df['SAP код Экструзия холодная резка'][i].split('-')[0]
    #     df_new['MATNR'][j] = df[i][0].split('-')[0]
    #     df_new['WERKS'][j] = 1101
    #     # df_new['TEXT1'][j] = df['Экструзия холодная резка'][i]
    #     df_new['TEXT1'][j] = df[i][1]
    #     df_new['STLAL'][j] = 1
    #     df_new['STLAN'][j] = 1
    #     if df[i][0].split('-')[1][:1]=='E':
    #         ztekst ='Экструзия (пресс) + Пила'
    #     df_new['ZTEXT'][j] = ztekst
    #     df_new['STKTX'][j] = 0
    #     df_new['BMENG'][j] = '1000'
    #     df_new['BMEIN'][j] ='ШТ'
    #     df_new['STLST'][j] =1
    #     df_new['POSNR'][j] =''
    #     df_new['POSTP'][j] =''
    #     df_new['MATNR1'][j] =''
    #     df_new['TEXT2'][j] =''
    #     df_new['MEINS'][j] =''
    #     df_new['MENGE'][j] =''
    #     df_new['DATUV'][j] ='01012021'
    #     df_new['PUSTOY'][j] =''
    #     df_new['LGORT'][j] =''
    #     length = df[i][0].split('-')[0]
    #     alum_teks = Norma.objects.filter(Q(компонент_1=length)|Q(компонент_2=length)|Q(компонент_3=length)|Q(артикул=length))[:1].get()
    #     for k in range(1,6):
    #         j+=1
    #         df_new['ID'][j] = ''
    #         df_new['MATNR'][j] = ''
    #         df_new['WERKS'][j] = ''
    #         df_new['TEXT1'][j] = ''
    #         df_new['STLAL'][j] = ''
    #         df_new['STLAN'][j] = ''
    #         df_new['ZTEXT'][j] = ''
    #         df_new['STKTX'][j] = ''
    #         df_new['BMENG'][j] = ''
    #         df_new['BMEIN'][j] =''
    #         df_new['STLST'][j] =''
    #         df_new['POSNR'][j] =k+1
    #         df_new['POSTP'][j] ='L'
            
            
    #         if k == 1 :
                
    #             if df_new['STLAL'][j] =='1':
    #                 aliminisi =AlyuminniysilindrEkstruziya1.objects.filter(тип =alum_teks.ala7_oddiy_ala8_qora_алю_сплав_6064)[:1].get()
    #                 df_new['MATNR1'][j] =aliminisi.sap_code_s4q100
    #                 df_new['TEXT2'][j] =aliminisi.название
                
    #             df_new['MEINS'][j] = alum_teks.алю_сп_6063_рас_спа_на_1000_шт_пр_кг
    #             df_new['MENGE'][j] = 'КГ'
    #             df_new['DATUV'][j] =''
    #             df_new['PUSTOY'][j] =''
              
    #         if k==2:
    #             alummm = AlyuminniysilindrEkstruziya2.objects.get(id=1)
    #             df_new['MATNR1'][j] =alummm.sap_code_s4q100
    #             df_new['TEXT2'][j] =alummm.название
    #             df_new['MENGE'][j] =alummm.еи
                
    #             df_new['MEINS'][j] = alum_teks.смазка_для_пресса_кг_графитовая
    #             df_new['DATUV'][j] =''
    #             df_new['PUSTOY'][j] =''
    #         if k==3:
    #             alummm = AlyuminniysilindrEkstruziya2.objects.get(id=2)
    #             df_new['MATNR1'][j] =alummm.sap_code_s4q100
    #             df_new['TEXT2'][j] =alummm.название
    #             df_new['MENGE'][j] =alummm.еи
                
    #             df_new['MEINS'][j] = float(alum_teks.смазка_для_пресса_кг_пилы_хл_резки_сол) + float(alum_teks.смазка_для_пресса_кг_горячей_резки_сол)
    #             df_new['DATUV'][j] =''
    #             df_new['PUSTOY'][j] =''
    #         if k == 4:
    #             alummm = AlyuminniysilindrEkstruziya2.objects.get(id=3)
    #             df_new['MATNR1'][j] =alummm.sap_code_s4q100
    #             df_new['TEXT2'][j] =alummm.название
    #             df_new['MENGE'][j] =alummm.еи
                
    #             df_new['MEINS'][j] = alum_teks.смазка_для_пресса_кг_графитовые_плиты
    #             df_new['DATUV'][j] =''
    #             df_new['PUSTOY'][j] =''
    #         if k == 5:
    #             alummm = AlyuminniysilindrEkstruziya2.objects.get(id=4)
    #             df_new['MATNR1'][j] =alummm.sap_code_s4q100
    #             df_new['TEXT2'][j] =alummm.название
    #             df_new['MENGE'][j] =alummm.еи
                
    #             df_new['MEINS'][j] = (-1)*(float(alum_teks.алю_сплав_6063_при_этом_тех_отхода1)+float(alum_teks.алю_сплав_6063_при_этом_тех_отхода2))
    #             df_new['DATUV'][j] =''
    #             df_new['PUSTOY'][j] =''
                
    #         df_new['LGORT'][j] ='PS01'
    #     df_new['STKTX'][j-5] =df_new['TEXT2'][j-4]
        
    #     j+=1
    #     df_new['ID'][j] = 1
    #     df_new['MATNR'][j] = df[i][0].split('-')[0]
    #     df_new['WERKS'][j] = 1101
    #     df_new['TEXT1'][j] = df[i][1]
    #     df_new['STLAL'][j] = 2
    #     df_new['STLAN'][j] = 1
    #     if df[i][0].split('-')[1][:1]=='E':
    #         ztekst ='Экструзия (пресс) + Пила'
    #     df_new['ZTEXT'][j] = ztekst
    #     df_new['STKTX'][j] = 0
    #     df_new['BMENG'][j] = '1000'
    #     df_new['BMEIN'][j] ='ШТ'
    #     df_new['STLST'][j] =1
    #     df_new['POSNR'][j] =''
    #     df_new['POSTP'][j] =''
    #     df_new['MATNR1'][j] =''
    #     df_new['TEXT2'][j] =''
    #     df_new['MEINS'][j] =''
    #     df_new['MENGE'][j] =''
    #     df_new['DATUV'][j] ='01012021'
    #     df_new['PUSTOY'][j] =''
    #     df_new['LGORT'][j] =''
    #     length = df[i][0].split('-')[0]
    #     alum_teks = Norma.objects.filter(Q(компонент_1=length)|Q(компонент_2=length)|Q(компонент_3=length)|Q(артикул=length))[:1].get()
    #     for k in range(1,6):
    #         j+=1
    #         df_new['ID'][j] = ''
    #         df_new['MATNR'][j] = ''
    #         df_new['WERKS'][j] = ''
    #         df_new['TEXT1'][j] = ''
    #         df_new['STLAL'][j] = ''
    #         df_new['STLAN'][j] = ''
    #         df_new['ZTEXT'][j] = ''
    #         df_new['STKTX'][j] = ''
    #         df_new['BMENG'][j] = ''
    #         df_new['BMEIN'][j] =''
    #         df_new['STLST'][j] =''
    #         df_new['POSNR'][j] =k+1
    #         df_new['POSTP'][j] ='L'
            
            
    #         if k == 1 :
                
    #             if df_new['STLAL'][j] =='2':
    #                 aliminisi =AlyuminniysilindrEkstruziya1.objects.filter(тип =alum_teks.ala7_oddiy_ala8_qora_алю_сплав_6064)[2:3].get()
    #                 df_new['MATNR1'][j] =aliminisi.sap_code_s4q100
    #                 df_new['TEXT2'][j] =aliminisi.название
                
    #             df_new['MEINS'][j] = alum_teks.алю_сп_6063_рас_спа_на_1000_шт_пр_кг
    #             df_new['MENGE'][j] = 'КГ'
    #             df_new['DATUV'][j] =''
    #             df_new['PUSTOY'][j] =''
              
    #         if k==2:
    #             alummm = AlyuminniysilindrEkstruziya2.objects.first()
    #             df_new['MATNR1'][j] =alummm.sap_code_s4q100
    #             df_new['TEXT2'][j] =alummm.название
    #             df_new['MENGE'][j] =alummm.еи
                
    #             df_new['MEINS'][j] = alum_teks.смазка_для_пресса_кг_графитовая
    #             df_new['DATUV'][j] =''
    #             df_new['PUSTOY'][j] =''
    #         if k==3:
    #             alummm = AlyuminniysilindrEkstruziya2.objects.get(id=2)
    #             df_new['MATNR1'][j] =alummm.sap_code_s4q100
    #             df_new['TEXT2'][j] =alummm.название
    #             df_new['MENGE'][j] =alummm.еи
                
    #             df_new['MEINS'][j] = float(alum_teks.смазка_для_пресса_кг_пилы_хл_резки_сол) + float(alum_teks.смазка_для_пресса_кг_горячей_резки_сол)
    #             df_new['DATUV'][j] =''
    #             df_new['PUSTOY'][j] =''
    #         if k == 4:
    #             alummm = AlyuminniysilindrEkstruziya2.objects.get(id=3)
    #             df_new['MATNR1'][j] =alummm.sap_code_s4q100
    #             df_new['TEXT2'][j] =alummm.название
    #             df_new['MENGE'][j] =alummm.еи
                
    #             df_new['MEINS'][j] = alum_teks.смазка_для_пресса_кг_графитовые_плиты
    #             df_new['DATUV'][j] =''
    #             df_new['PUSTOY'][j] =''
    #         if k == 5:
    #             alummm = AlyuminniysilindrEkstruziya2.objects.get(id=4)
    #             df_new['MATNR1'][j] =alummm.sap_code_s4q100
    #             df_new['TEXT2'][j] =alummm.название
    #             df_new['MENGE'][j] =alummm.еи
                
    #             df_new['MEINS'][j] = (-1)*(float(alum_teks.алю_сплав_6063_при_этом_тех_отхода1)+float(alum_teks.алю_сплав_6063_при_этом_тех_отхода2))
    #             df_new['DATUV'][j] =''
    #             df_new['PUSTOY'][j] =''
                
    #         df_new['LGORT'][j] ='PS01'
    #     df_new['STKTX'][j-5] =df_new['TEXT2'][j-4]