

BAZA ={
    'E':{
        'ARBPL':['1101A101','1101A102'],
        'LTXA1':['Экструзия (пресс)','Пила холодной резки'],
        'ACTTYPE_01':['200020','200020'],
        'VORNR':['0010','0020'],
        'MEINH':['ST','ST']
    },
    'Z':{
        'ARBPL':['1101A101','1101A102','1101A201'],
        'LTXA1':['Экструзия (пресс)','Пила холодной резки','Старение'],
        'ACTTYPE_01':['200020','200020','200030'],
        'VORNR':['0010','0020','0030'],
        'MEINH':['ST','ST','ST']
    },
    'P1':{
        'ARBPL':['1101B111'],
        'LTXA1':['SKM - SKM покраска'],
        'ACTTYPE_01':['200040'],
        'VORNR':['0010'],
        'MEINH':['ST']
    },
    'P2':{
        'ARBPL':['1101B121'],
        'LTXA1':['SAT - SAT покраска'],
        'ACTTYPE_01':['200040'],
        'VORNR':['0010'],
        'MEINH':['ST']
    },
    'P3':{
        'ARBPL':['1101B131'],
        'LTXA1':['ГР - ГР покраска'],
        'ACTTYPE_01':['200040'],
        'VORNR':['0010'],
        'MEINH':['ST']
    },
    'P4':{
        'ARBPL':['1101B111','1101B141'],
        'LTXA1':['SKM Хим. обработка','SKM - Ручная покраска'],
        'ACTTYPE_01':['200040','200040'],
        'VORNR':['0009','0010'],
        'MEINH':['ST','ST'],
        },
    'P5':{
        'ARBPL':['1101B121','1101B141'],
        'LTXA1':['SAT Хим. обработка','SAT - Ручная покраска'],
        'ACTTYPE_01':['200040','200040'],
        'VORNR':['0009','0010'],
        'MEINH':['ST','ST'],
        },
    'P6':{
        'ARBPL':['1101B131','1101B141'],
        'LTXA1':['ГР Хим. обработка','ГР - Ручная покраска'],
        'ACTTYPE_01':['200040','200040'],
        'VORNR':['0009','0010'],
        'MEINH':['ST','ST'],
        },
    'S':{
        'ARBPL':['1101C101'],
        'LTXA1':['Сублимация'],
        'ACTTYPE_01':['200050'],
        'VORNR':['0010'],
        'MEINH':['ST']
    },
    'N':{
        'ARBPL':['1101D101'],
        'LTXA1':['Упаковка'],
        'ACTTYPE_01':['200080'],
        'VORNR':['0010'],
        'MEINH':['ST']
    },
    'K':{
        'ARBPL':['1101C201'],
        'LTXA1':['Комбинирование'],
        'ACTTYPE_01':['200060'],
        'VORNR':['0010'],
        'MEINH':['ST']
    },
    '7':{
        'ARBPL':['1101D101'],
        'LTXA1':['Упаковка'],
        'ACTTYPE_01':['200080'],
        'VORNR':['0010'],
        'MEINH':['ST']
    },
    '7N':{
        'ARBPL':['1101D101'],
        'LTXA1':['Не упаковывается'],
        'ACTTYPE_01':['200080'],
        'VORNR':['0010'],
        'MEINH':['ST']
    },
    '7L':{
        'ARBPL':['1101C301'],
        'LTXA1':['Ламинация + Наклейка + Упаковка'],
        'ACTTYPE_01':['200170'],
        'VORNR':['0010'],
        'MEINH':['ST']
    },
    '7LN':{
        'ARBPL':['1101C301'],
        'LTXA1':['Не упаковывается'],
        'ACTTYPE_01':['200170'],
        'VORNR':['0010'],
        'MEINH':['ST']
    },
    '7K':{
        'ARBPL':['1101C201'],
        'LTXA1':['Комбинированный + Упаковка'],
        'ACTTYPE_01':['200060'],
        'VORNR':['0010'],
        'MEINH':['ST']
    },
    '7KN':{
        'ARBPL':['1101C201'],
        'LTXA1':['Не упаковывается'],
        'ACTTYPE_01':['200060'],
        'VORNR':['0010'],
        'MEINH':['ST']
    }
}
