

BAZA ={
    'E':{
        'ARBPL':['1101A101','1101A102'],
        'LTXA1':['Экструзия (пресс)','Пила холодной резки'],
        'ACTTYPE_01':['200020','200020'],
        'VORNR':['0010','0020'],
        'MEINH':['KG','ST']
    },
    'Z':{
        'ARBPL':['1101A101','1101A102','1101A201'],
        'LTXA1':['Экструзия (пресс)','Пила холодной резки','Старение'],
        'ACTTYPE_01':['200020','200020','200020'],
        'VORNR':['0010','0020','0030'],
        'MEINH':['KG','ST','ST']
    },
    'P1':{
        'ARBPL':['1101B111'],
        'LTXA1':['Покраска SKM'],
        'ACTTYPE_01':['200040'],
        'VORNR':['0010'],
        'MEINH':['ST']
    },
    'P2':{
        'ARBPL':['1101B121'],
        'LTXA1':['Покраска SAT'],
        'ACTTYPE_01':['200040'],
        'VORNR':['0010'],
        'MEINH':['ST']
    },
    'P3':{
        'ARBPL':['1101B131'],
        'LTXA1':['Покраска Горизонтальная'],
        'ACTTYPE_01':['200040'],
        'VORNR':['0010'],
        'MEINH':['ST']
    },
    'P4':{
        'ARBPL':['1101B141'],
        'LTXA1':['Покраска Ручная'],
        'ACTTYPE_01':['200040'],
        'VORNR':['0010'],
        'MEINH':['ST']
    },
    'S':{
        'ARBPL':['1101C101'],
        'LTXA1':['Сублимация'],
        'ACTTYPE_01':['200050'],
        'VORNR':['0010'],
        'MEINH':['ST']
    },
    'N':{
        'ARBPL':['1101D101'],
        'LTXA1':['Упаковка'],
        'ACTTYPE_01':['200080'],
        'VORNR':['0010'],
        'MEINH':['ST']
    },
    'K':{
        'ARBPL':['1101C201'],
        'LTXA1':['Комбинирование'],
        'ACTTYPE_01':['200060'],
        'VORNR':['0010'],
        'MEINH':['ST']
    },
    '7':{
        'ARBPL':['1101D101'],
        'LTXA1':['Упаковка'],
        'ACTTYPE_01':['200080'],
        'VORNR':['0010'],
        'MEINH':['ST']
    }
}
