

BAZA ={
    'E':{
        '1':{
            'KTEXT':['Экcтрудер (пресс) №3 (1000 UST) \ Экструдирование'],
            'ARBPL':['1201A301','1201A302'],
            'LTXA1':['Экcтрудер (пресс) №3 (1000 UST) \ Экструдирование','Пила холодной резки №3 (1000 UST) \ Резка профили'],
            'VORNR':['0010','0020'],
            'BMSCH':['550']
            },   
        '2':{
            'KTEXT':['Экcтрудер (пресс) №4 (1000 UST) \ Экструдирование'],
            'ARBPL':['1201A303','1201A304'],
            'LTXA1':['Экcтрудер (пресс) №4 (1000 UST) \ Экструдирование','Пила холодной резки №4 (1000 UST) \ Резка профили'],
            'VORNR':['0010','0020'],
            'BMSCH':['550']
            },   
        '3':{
            'KTEXT':['Экcтрудер (пресс) №2 (2000 UST) \ Экструдирование'],
            'ARBPL':['1201A305','1201A306'],
            'LTXA1':['Экcтрудер (пресс) №2 (2000 UST) \ Экструдирование','Пила холодной резки №2 (2000 UST) \ Резка профили'],
            'VORNR':['0010','0020'],
            'BMSCH':['1050']
            },   
        '4':{
            'KTEXT':['Экcтрудер (пресс) №5 (2000 UST) \ Экструдирование'],
            'ARBPL':['1201A307','1201A308'],
            'LTXA1':['Экcтрудер (пресс) №6 (2000 UST) \ Экструдирование','Пила холодной резки №6 (2000 UST) \ Резка профили'],
            'VORNR':['0010','0020'],
            'BMSCH':['1000']
            },   
        '5':{
            'KTEXT':['Экcтрудер (пресс) №6 (2000 UST) \ Экструдирование'],
            'ARBPL':['1201A309','1201A310'],
            'LTXA1':['Экcтрудер (пресс) №1 (4000 UST) \ Экструдирование','Пила холодной резки №1 (4000 UST) \ Резка профили'],
            'VORNR':['0010','0020'],
            'BMSCH':['1000']
            },   
        '6':{
            'KTEXT':['Экcтрудер (пресс) №1 (4000 UST) \ Экструдирование'],
            'ARBPL':['1201A311','1201A312'],
            'LTXA1':['Экcтрудер (пресс) №3 (1000 UST) \ Экструдирование','Пила холодной резки №3 (1000 UST) \ Резка профили'],
            'VORNR':['0010','0020'],
            'BMSCH':['1200']
            },   
        },
    
    'P':{
        '1':{
            'KTEXT':['Покраска автомат №1 (SAT) (Вход) \ Покраска автомат'],
            'ARBPL':['1201B103','1201B101'],
            'LTXA1':['Покраска автомат №1 (SAT) (Вход) \ Покраска автомат','Покраска автомат №1 (SAT) (Выход) \ Покраска автомат'],
            'ACTTYPE_01':['200040','200040'],
            'VORNR':['0010','0020'],
            'MEINH':['KG','ST'],
            
        },
        '2':{
            'KTEXT':['Покраска автомат №2 (SAT) (Вход) \ Покраска автомат'],
            'ARBPL':['1201B104','1201B102'],
            'LTXA1':['Покраска автомат №2 (SAT) (Вход) \ Покраска автомат','Покраска автомат №2 (SAT) (Выход) \ Покраска автомат'],
            'ACTTYPE_01':['200040','200040'],
            'VORNR':['0010','0020'],
            'MEINH':['KG','ST'],
            
        },
    },
    'S':{
        'ARBPL':['1101C101'],
        'LTXA1':['Сублимация'],
        'ACTTYPE_01':['200050'],
        'VORNR':['0010'],
        'MEINH':['ST']
    },
    'N':{
        'ARBPL':['1101D101'],
        'LTXA1':['Наклейка'],
        'ACTTYPE_01':['200080'],
        'VORNR':['0010'],
        'MEINH':['ST']
    },
    'K':{
        'ARBPL':['1101C201'],
        'LTXA1':['Комбинирование'],
        'ACTTYPE_01':['200060'],
        'VORNR':['0010'],
        'MEINH':['ST']
    },
    '7':{
        'ARBPL':['1101D101'],
        'LTXA1':['Упаковка'],
        'ACTTYPE_01':['200080'],
        'VORNR':['0010'],
        'MEINH':['ST']
    },
    '7N':{
        'ARBPL':['1101D101'],
        'LTXA1':['Не упаковывается'],
        'ACTTYPE_01':['200080'],
        'VORNR':['0010'],
        'MEINH':['ST']
    },
    '7L':{
        'ARBPL':['1101C301'],
        'LTXA1':['Ламинация + Наклейка + Упаковка','Ламинация + Упаковка'],
        'ACTTYPE_01':['200170'],
        'VORNR':['0010'],
        'MEINH':['ST']
    },
    '7LN':{
        'ARBPL':['1101C301'],
        'LTXA1':['Не упаковывается'],
        'ACTTYPE_01':['200170'],
        'VORNR':['0010'],
        'MEINH':['ST']
    },
    '7K':{
        'ARBPL':['1101C201'],
        'LTXA1':['Комбинированный + Упаковка'],
        'ACTTYPE_01':['200060'],
        'VORNR':['0010'],
        'MEINH':['ST']
    },
    '7KN':{
        'ARBPL':['1101C201'],
        'LTXA1':['Не упаковывается'],
        'ACTTYPE_01':['200060'],
        'VORNR':['0010'],
        'MEINH':['ST']
    }
}
